package com.sun.study.module.HighQualityCode;

/**
 * Created by sunfusheng on 15/12/11.
 */
public class _0_Preface {

    /**
     *
     * 编写高质量代码：改善Java程序的151个建议
     * 原作者：秦小波
     * 笔记者：孙福生
     *
     * 前言
     *
     * 一直想系统学习一遍Java，偶然间从同事李旺成那知道了这本书，确实不错，立刻开始学习。
     *
     * 这是一本关于Java编码最佳实践的集大成之作，也是一本能指导Java程序员写出高质量代码的指点迷津之作。
     *
     * 看到这些笔记的你也不要犹豫了，即刻开始学习吧。
     *
     * 因为...
     *
     * 这是一个英雄辈出的年代，我们每个人都希望自己被顶礼膜拜，可是这需要资本贺实力，
     * 而我们的实力体现了我们处理技术问题的能力：
     * ● 你能写出简单、清晰、高效的代码？--> Show it!
     * ● 你能架构一个稳定、健壮、快捷的系统？--> Do it!
     * ● 你能回答一个困扰N多人的问题？--> Answer it!
     * ● 你能修复一个系统Bug？--> Fix it!
     * ● 你非常熟悉某个开源产品？--> Broadcast it!
     * ● 你能提升系统性能？--> Tune it!
     * ● ...
     *
     * 这是一本建议书，想想看，在您写代码的时候，有这样一本书籍在您手边，告诉您如何才能
     * 编写出优雅而高效的代码，那将是多么惬意的事情啊！
     *
     * 开始...
     *
     * 笔记目录
     *
     * 第一章 Java开发中通用的方法贺准则
     * 第二章 基本类型
     * 第三章 类、对象及方法
     * 第四章 字符串
     * 第五章 数组和集合
     * 第六章 枚举和注解
     * 第七章 泛型和反射
     * 第八章 异常
     * 第九章 多线程和并发
     * 第十章 性能和效率
     * 第十一章 开源世界
     * 第十二章 思想为源
     *
     */
}
